settlingTank2D_M3A2E6_redAlpha_base/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0.00 0.000 -0.001)
    (0.03 0.000 -0.001)
    (0.03 0.061 -0.001)
    (0.00 0.061 -0.001)
    (0.00 0.000 0.001)
    (0.03 0.000 0.001)
    (0.03 0.061 0.001)
    (0.00 0.061 0.001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (30 200 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch bot
    (
        (1 5 4 0)
    )
    patch top
    (
        (3 7 6 2)
    )
    wall walls
    (
        (0 4 7 3)
        (2 6 5 1)
    )
    empty frontAndBackPlanes
    (
        (0 3 2 1)
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
